Emacs_27.2_Installation.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org026f9b7">1. Installation</a>
<ul>
<li><a href="#org0dfa198">1.1. Build from Source (Debian)</a></li>
<li><a href="#org53b2226">1.2. Build from Source (Ubuntu)</a></li>
</ul>
</li>
<li><a href="#orgdf317fd">2. Use This Customization</a></li>
<li><a href="#org1972a7b">3. Uninstallation</a></li>
</ul>
</div>
</div>

<div id="outline-container-org026f9b7" class="outline-2">
<h2 id="org026f9b7"><span class="section-number-2">1</span> Installation</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0dfa198" class="outline-3">
<h3 id="org0dfa198"><span class="section-number-3">1.1</span> Build from Source (Debian)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Link: <a href="https://github.com/hubisan/emacs-wsl#install-emacs-272">hubisan/emacs-wsl</a>
</p>
<ol class="org-ol">
<li>Install all dependencies (taken from the snap):</li>
</ol>
<div class="org-src-container">
<pre class="src src-bash">      sudo apt update
      sudo apt install -y autoconf automake bsd-mailx dbus-x11 debhelper dpkg-dev \
	  libacl1-dev libasound2-dev libdbus-1-dev libgif-dev libgnutls28-dev libgpm-dev \
	  libgtk-3-dev libjansson-dev libjpeg-dev liblcms2-dev liblockfile-dev libm17n-dev \
	  libncurses5-dev libotf-dev libpng-dev librsvg2-dev \
	  libselinux1-dev libsystemd-dev libtiff-dev libxml2-dev libxpm-dev procps quilt \
	  sharutils texinfo zlib1g-dev gvfs libasound2 libaspell15 \
	  libasyncns0 libatk-bridge2.0-0 libatk1.0-0 libatspi2.0-0 libbrotli1 \
	  libcairo-gobject2 libcairo2 libcanberra-gtk3-0 libcanberra-gtk3-module \
	  libcanberra0 libdatrie1 libdb5.3 libdrm2 libegl1 \
	  libepoxy0 libflac8 libfontconfig1 libfreetype6 libgbm1 libgdk-pixbuf2.0-0 \
	  libgif7 libgl1 libglvnd0 libglx0 libgpm2 libgraphite2-3 libgstreamer-gl1.0-0 \
	  libgstreamer-plugins-base1.0-0 libgstreamer1.0-0 libgtk-3-0 libgudev-1.0-0 \
	  libharfbuzz-icu0 libharfbuzz0b libhyphen0 libice6 libjansson4 \
	  libjavascriptcoregtk-4.0-18 libjbig0 liblcms2-2 liblockfile1 \
	  libltdl7 libm17n-0 libnotify4 libnss-mdns libnss-myhostname libnss-systemd \
	  libogg0 liborc-0.4-0 libotf0 libpango-1.0-0 libpangocairo-1.0-0 \
	  libpangoft2-1.0-0 libpixman-1-0 libpng16-16 libpulse0 librsvg2-2 libsasl2-2 \
	  libsecret-1-0 libsm6 libsndfile1 libsoup2.4-1 libssl1.1 libstdc++6 libtdb1 \
	  libthai0 libtiff5 libvorbis0a libvorbisenc2 libvorbisfile3 libwayland-client0 \
	  libwayland-cursor0 libwayland-egl1 libwayland-server0 libwebp6 libwebpdemux2 \
	  libwoff1 libx11-6 libx11-xcb1 libxau6 libxcb-render0 libxcb-shm0 libxcb1 \
	  libxcomposite1 libxcursor1 libxdamage1 libxdmcp6 libxext6 libxfixes3 libxi6 \
	  libxinerama1 libxkbcommon0 libxml2 libxpm4 libxrandr2 libxrender1 libxslt1.1 \
	  libyajl2 \
</pre>
</div>
<p>
Problematic packages on Debian
</p>
<div class="org-src-container">
<pre class="src src-bash">      sudo apt install language-pack-en-base liboss4-salsa2 libcroco3 libenchant1c2a libicu66 libjpeg-turbo8 
</pre>
</div>
<ol class="org-ol">
<li>Download and extract emacs</li>
</ol>
<div class="org-src-container">
<pre class="src src-bash">      cd ~
      wget https://ftp.gnu.org/pub/gnu/emacs/emacs-27.2.tar.gz
      tar -xvzf emacs-27.2.tar.gz
</pre>
</div>
<ol class="org-ol">
<li>Configure and install emacs: This step will take a while and you are prompted to enter your password once.</li>
</ol>
<div class="org-src-container">
<pre class="src src-bash">      cd ~/emacs-27.2
      ./configure --with-cairo
      make
      sudo make install
      rm ~/emacs-27.2.tar.gz
</pre>
</div>
<ol class="org-ol">
<li>Try out if emacs works correctly with</li>
</ol>
<div class="org-src-container">
<pre class="src src-bash">      emacs -nw
</pre>
</div>
</div>
</div>
<div id="outline-container-org53b2226" class="outline-3">
<h3 id="org53b2226"><span class="section-number-3">1.2</span> Build from Source (Ubuntu)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Link: <a href="https://github.com/hubisan/emacs-wsl#install-emacs-272">hubisan/emacs-wsl</a>
</p>
<ol class="org-ol">
<li>Install all dependencies (taken from the snap):</li>
</ol>
<div class="org-src-container">
<pre class="src src-bash">      sudo apt update
      sudo apt install -y autoconf automake bsd-mailx dbus-x11 debhelper dpkg-dev \
	  libacl1-dev libasound2-dev libdbus-1-dev libgif-dev libgnutls28-dev libgpm-dev \
	  libgtk-3-dev libjansson-dev libjpeg-dev liblcms2-dev liblockfile-dev libm17n-dev \
	  libncurses5-dev libotf-dev libpng-dev librsvg2-dev \
	  libselinux1-dev libtiff-dev libxml2-dev libxpm-dev procps quilt \
	  sharutils texinfo zlib1g-dev gvfs libasound2 libaspell15 \
	  libasyncns0 libatk-bridge2.0-0 libatk1.0-0 libatspi2.0-0 libbrotli1 \
	  libcairo-gobject2 libcairo2 libcanberra-gtk3-0 libcanberra-gtk3-module \
	  libcanberra0 libdatrie1 libdb5.3 libdrm2 libegl1 \
	  libepoxy0 libflac8 libfontconfig1 libfreetype6 libgbm1 libgdk-pixbuf2.0-0 \
	  libgif7 libgl1 libglvnd0 libglx0 libgpm2 libgraphite2-3 libgstreamer-gl1.0-0 \
	  libgstreamer-plugins-base1.0-0 libgstreamer1.0-0 libgtk-3-0 libgudev-1.0-0 \
	  libharfbuzz-icu0 libharfbuzz0b libhyphen0 libice6 libjansson4 \
	  libjavascriptcoregtk-4.0-18 libjbig0 liblcms2-2 liblockfile1 \
	  libltdl7 libm17n-0 libnotify4 libnss-mdns libnss-myhostname libnss-systemd \
	  libogg0 liborc-0.4-0  libpango-1.0-0 libpangocairo-1.0-0 \
	  libpangoft2-1.0-0 libpixman-1-0 libpng16-16 libpulse0 librsvg2-2 libsasl2-2 \
	  libsecret-1-0 libsm6 libsndfile1 libsoup2.4-1 libstdc++6 libtdb1 \
	  libthai0 libtiff5 libvorbis0a libvorbisenc2 libvorbisfile3 libwayland-client0 \
	  libwayland-cursor0 libwayland-egl1 libwayland-server0 libwebpdemux2 \
	  libwoff1 libx11-6 libx11-xcb1 libxau6 libxcb-render0 libxcb-shm0 libxcb1 \
	  libxcomposite1 libxcursor1 libxdamage1 libxdmcp6 libxext6 libxfixes3 libxi6 \
	  libxinerama1 libxkbcommon0 libxml2 libxpm4 libxrandr2 libxrender1 libxslt1.1 \
	  libyajl2 
</pre>
</div>
<p>
Problematic packages on Ubuntu
</p>
<div class="org-src-container">
<pre class="src src-bash">      sudo apt install libsystemd-dev libwebp6 libssl1.1 libotf0 language-pack-en-base liboss4-salsa2 libcroco3 libenchant1c2a libicu66 libjpeg-turbo8 
</pre>
</div>
<ol class="org-ol">
<li>Download and extract emacs</li>
</ol>
<div class="org-src-container">
<pre class="src src-bash">      cd ~
      wget https://ftp.gnu.org/pub/gnu/emacs/emacs-27.2.tar.gz
      tar -xvzf emacs-27.2.tar.gz
</pre>
</div>
<ol class="org-ol">
<li>Configure and install emacs: This step will take a while and you are prompted to enter your password once.</li>
</ol>
<div class="org-src-container">
<pre class="src src-bash">      cd ~/emacs-27.2
      ./configure --with-cairo
      make
      sudo make install
      rm ~/emacs-27.2.tar.gz
</pre>
</div>
<ol class="org-ol">
<li>Try out if emacs works correctly with</li>
</ol>
<div class="org-src-container">
<pre class="src src-bash">      emacs -nw
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdf317fd" class="outline-2">
<h2 id="orgdf317fd"><span class="section-number-2">2</span> Use This Customization</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Backup the local copy of <code>~/.emacs.d</code>:
<code>mv ~~/.emacs.d ~~/.emacs.d.bak</code></li>
<li>Copy the <code>~/.emacs.d</code> in this directory to the user home:
<code>cp -r ./.emacs.d ~~/</code></li>
<li>Create a directory for RoamNotes (or modify <code>~/.emacs.d/myinit.org</code> to not include Org-Roam):
<code>mkdir -p ~~/Notes</code></li>
<li>Ensure an internet connection is active to enable package: installations</li>
<li>Run emacs as a daemon:
<code>emacs --fg-daemon --debug-init</code></li>
<li>Modify fonts named in <code>~/.emacs.d/myinit.org</code> for your own installed fonts.</li>
<li>If configuration is successful, initiate emacs client:
<code>emacsclient -cn</code></li>
<li>Otherwise, modify problematic parts of <code>~/.emacs.d/myinit.org</code> as the debugger indicates for your own system.</li>
</ol>
</div>
</div>
<div id="outline-container-org1972a7b" class="outline-2">
<h2 id="org1972a7b"><span class="section-number-2">3</span> Uninstallation</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-bash">   dpkg --get-selections | grep emacs
   sudo apt remove --purge emacs-bin-common emacs-el emacs-gtk
   cd ~/emacs-27.X
   sudo make uninstall
</pre>
</div>
</div>
</div>
